NevynUK/ESP32-P4-Protected-Mode-Sample/main/kernel_main.c
#include <stdarg.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <stdio.h>

#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include "freertos/task.h"

#include "esp_attr.h"
#include "esp_rom_sys.h"
#include "soc/assist_debug_reg.h"
#include "soc/clic_reg.h"
#include "soc/interrupts.h"
#include "soc/soc.h"
#include "soc/soc_caps.h"

#include "syscall.h"
#include "umode.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* The user application's entire world: its stack grows down from the top and
 * every pointer it hands the kernel has to land inside this.
 */

#define USER_ARENA_SIZE 8192

#define KERNEL_TASK_STACK 3072
#define USER_HOST_STACK 4096
#define KERNEL_TASK_PRIO 5
#define USER_HOST_PRIO 5

/* One U-mode window per core, each with its own host task, its own arena and
 * its own user context.  The two are independent all the way down: every CSR
 * umode_enter() borrows is per-hart, umode.S picks its assist_debug block from
 * mhartid, and umode.S has no writable data of its own -- its only sections are
 * "ax" and "a" -- so both cores run the same window code re-entrantly.
 *
 * NOTHING HERE IS PINNED.  Both host tasks and the kernel task are created
 * with tskNO_AFFINITY, so which core a U-mode window runs on is the
 * scheduler's choice and can change from one window to the next.
 *
 * A window still cannot span two cores, but it does not need an affinity to
 * guarantee that: umode_enter() takes mstatus.MIE down BEFORE it snapshots any
 * per-hart CSR, so from that point to the closing mret the hart cannot be
 * preempted and everything hart-specific is read and restored on the same
 * core.  Get that ordering wrong and a tick landing in the gap puts one core's
 * vectors back on another -- see 3.6 in the README, which is the reason this
 * file is allowed to say the sentence above.
 */

/* Three windows on two cores, deliberately.
 *
 * Two unpinned windows on two cores is a stable assignment: the scheduler has
 * no reason to move either, and the demo shows two tasks that are unpinned in
 * principle and motionless in practice.  Oversubscribing the cores is what
 * makes the scheduler actually move them, so the claim can be watched rather
 * than taken on trust.
 */

#define USER_SLOTS 8

#define KERNEL_PERIOD_MS 1000

/* How often kernel_task prints the window/core summary, in its own periods */

#define MIGRATION_REPORT_EVERY 3

/* Longest SYS_PUTS message the kernel will copy out of the arena */

#define SYS_PUTS_MAX 128

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* U-mode's memory: one arena per slot.  In .bss, so in DRAM, which is the
 * region ESP-IDF's locked PMP entry 5 grants U-mode read+write on.
 *
 * Separate arrays rather than one two-dimensional one so that each is its own
 * object with its own bounds, which is what user_range_ok() checks against.
 */

static uint8_t g_user_arenas[USER_SLOTS][USER_ARENA_SIZE] __attribute__((aligned(16)));

/* Names live here rather than as string literals because the slots are built
 * in a loop now; "user0".."user7" at eight slots.
 */

static char g_slot_names[USER_SLOTS][8];

/* Everything one U-mode window owns.
 *
 * The point of gathering it here rather than in file-scope globals is that
 * TWO of these are now live at once, on two cores, running concurrently.  Any
 * mutable state left shared between them would be a cross-core data race --
 * and, in the case of the arena bounds, a hole: without a per-slot arena to
 * check against, user 0 could hand the kernel a pointer into user 1's arena
 * and user_range_ok() would wave it through.
 *
 * The console mutex below is the ONLY thing the two deliberately share.
 */

typedef struct
{
    const char *name;         /* what the kernel calls it in messages       */
    uint32_t id;              /* passed to user_main() in a0                */
    int core;                 /* the core its last window ran on            */
    uint32_t migrations;      /* windows resumed on a different core        */
    uint8_t *arena;           /* its U-mode memory: stack and data          */
    uint32_t arena_size;

    /* The context umode_enter() runs.  It lives here rather than on the host
     * task's stack because the trap vector reaches it through mscratch and it
     * must outlive every path through the window.
     */

    umode_ctx_t ctx;

    volatile bool running;

    /* Per-slot counters.  Two host tasks on two cores incrementing one
     * counter is a data race with no lock in sight, so each keeps its own.
     */

    uint32_t syscalls;
    uint32_t irqs_in_user;
    bool umode_confirmed;
} user_slot_t;

static user_slot_t g_slots[USER_SLOTS];

static SemaphoreHandle_t g_console_mux;

/* Placed by the linker at the end of IRAM text; the top of the region PMP
 * entry 4 grants U-mode execute on.
 */

extern int _iram_text_end;

/****************************************************************************
 * Layout checks
 *
 * umode.S addresses the context through the UCTX_* macros in umode.h.  If the
 * struct and the macros ever drift, the failure is a wild store in a trap
 * vector; catch it at compile time instead.
 ****************************************************************************/

_Static_assert(offsetof(umode_ctx_t, x) == UCTX_X(0), "umode_ctx_t.x moved");
_Static_assert(offsetof(umode_ctx_t, pc) == UCTX_PC, "umode_ctx_t.pc moved");
_Static_assert(offsetof(umode_ctx_t, mcause) == UCTX_MCAUSE, "umode_ctx_t.mcause moved");
_Static_assert(offsetof(umode_ctx_t, mtval) == UCTX_MTVAL, "umode_ctx_t.mtval moved");
_Static_assert(offsetof(umode_ctx_t, k_sp) == UCTX_K_SP, "umode_ctx_t.k_sp moved");
_Static_assert(offsetof(umode_ctx_t, k_mtvec) == UCTX_K_MTVEC, "umode_ctx_t.k_mtvec moved");
_Static_assert(offsetof(umode_ctx_t, k_mtvt) == UCTX_K_MTVT, "umode_ctx_t.k_mtvt moved");
_Static_assert(offsetof(umode_ctx_t, k_mscratch) == UCTX_K_MSCRATCH, "umode_ctx_t.k_mscratch moved");
_Static_assert(offsetof(umode_ctx_t, k_mstatus) == UCTX_K_MSTATUS, "umode_ctx_t.k_mstatus moved");
_Static_assert(offsetof(umode_ctx_t, k_mintstatus) == UCTX_K_MINTSTATUS, "umode_ctx_t.k_mintstatus moved");
_Static_assert(offsetof(umode_ctx_t, k_thresh) == UCTX_K_THRESH, "umode_ctx_t.k_thresh moved");
_Static_assert(offsetof(umode_ctx_t, k_sp_min) == UCTX_K_SP_MIN, "umode_ctx_t.k_sp_min moved");
_Static_assert(offsetof(umode_ctx_t, k_sp_max) == UCTX_K_SP_MAX, "umode_ctx_t.k_sp_max moved");
_Static_assert(offsetof(umode_ctx_t, u_sp_min) == UCTX_U_SP_MIN, "umode_ctx_t.u_sp_min moved");
_Static_assert(offsetof(umode_ctx_t, u_sp_max) == UCTX_U_SP_MAX, "umode_ctx_t.u_sp_max moved");
_Static_assert(offsetof(umode_ctx_t, sp_fired) == UCTX_SP_FIRED, "umode_ctx_t.sp_fired moved");
_Static_assert(offsetof(umode_ctx_t, sp_pc) == UCTX_SP_PC, "umode_ctx_t.sp_pc moved");
_Static_assert(sizeof(umode_ctx_t) == UCTX_SIZE, "umode_ctx_t size changed");

/* umode.S reads five assist_debug registers with plain loads and stores, and
 * hw_stack_guard.h names only the CORE_0 copies as addresses.  It reaches the
 * current core's copy by adding mhartid * ASSIST_DEBUG_CORE_STRIDE, which is
 * correct only while the per-core blocks are evenly spaced and that spacing is
 * the shift UMODE_CORE_OFF applies.  Neither is something umode.S can check
 * for itself, so check all five here.
 */

