NevynUK/ESP32-P4-Protected-Mode-Sample/main/kernel_main.c
    static const char *const modes[] = { "OFF", "TOR", "NA4", "NAPOT" };

    uint32_t lo[16];
    uint32_t hi[16];
    int n = 0;
    int i;
    int j;

    kprintf("KERNEL: PMP entries:\n");

    for (i = 0; i < 16; i++)
    {
        const uint32_t cfg = (umode_read_pmpcfg(i / 4) >> ((i % 4) * 8)) & 0xff;
        const uint32_t addr = umode_read_pmpaddr(i);
        const unsigned mode = (cfg >> 3) & 3;
        uint32_t a = 0;
        uint32_t b = 0;

        if (mode == 1)                      /* TOR: [previous entry, this)  */
        {
            a = (i > 0) ? (umode_read_pmpaddr(i - 1) << 2) : 0;
            b = addr << 2;
        }
        else if (mode == 2)                 /* NA4: exactly four bytes      */
        {
            a = addr << 2;
            b = a + 4;
        }
        else if (mode == 3)                 /* NAPOT: size from trailing 1s */
        {
            const uint32_t inv = ~addr & (addr + 1);

            a = (addr & ~(inv - 1)) << 2;
            b = a + (inv << 3);
        }

        if (mode != 0 && b > a)
        {
            kprintf("KERNEL:   %2d %s %-5s %c%c%c %08lx..%08lx\n", i, (cfg & 0x80) ? "L" : "-", modes[mode], (cfg & 1) ? 'R' : '-', (cfg & 2) ? 'W' : '-', (cfg & 4) ? 'X' : '-', (unsigned long) a, (unsigned long) b);

            lo[n] = a;
            hi[n] = b;
            n++;
        }
        else
        {
            /* An entry that matches nothing: disabled, or a TOR whose base
             * and limit are the same address.
             */

            kprintf("KERNEL:   %2d %s %-5s --- matches nothing\n", i, (cfg & 0x80) ? "L" : "-", modes[mode]);
        }
    }

    /* Sort and merge the covered ranges.  Sixteen entries, so the simplest
     * sort that works is the right one.
     */

    for (i = 1; i < n; i++)
    {
        const uint32_t kl = lo[i];
        const uint32_t kh = hi[i];

        for (j = i - 1; j >= 0 && lo[j] > kl; j--)
        {
            lo[j + 1] = lo[j];
            hi[j + 1] = hi[j];
        }

        lo[j + 1] = kl;
        hi[j + 1] = kh;
    }

    for (i = 0, j = 0; i < n; i++)
    {
        if (j > 0 && lo[i] <= hi[j - 1])
        {
            if (hi[i] > hi[j - 1])
            {
                hi[j - 1] = hi[i];
            }
        }
        else
        {
            lo[j] = lo[i];
            hi[j] = hi[i];
            j++;
        }
    }

    n = j;

    kprintf(
        "KERNEL: no PMP entry matches these, so U-mode cannot reach them at\n"
        "KERNEL:   all while the kernel still can:\n");

    for (i = 0; i < (int) (sizeof(regions) / sizeof(regions[0])); i++)
    {
        uint32_t cur = regions[i].lo;
        bool any = false;

        for (j = 0; j < n && cur < regions[i].hi; j++)
        {
            if (hi[j] <= cur || lo[j] >= regions[i].hi)
            {
                continue;
            }

            if (lo[j] > cur)
            {
                kprintf("KERNEL:   %-14s %08lx..%08lx (%lu KiB)\n", regions[i].name, (unsigned long) cur, (unsigned long) lo[j], (unsigned long) ((lo[j] - cur) / 1024));
                any = true;
            }

            if (hi[j] > cur)
            {
                cur = hi[j];
            }
        }

        if (cur < regions[i].hi)
        {
            kprintf("KERNEL:   %-14s %08lx..%08lx (%lu KiB)\n", regions[i].name, (unsigned long) cur, (unsigned long) regions[i].hi, (unsigned long) ((regions[i].hi - cur) / 1024));
            any = true;
        }

        if (!any)
        {
            kprintf("KERNEL:   %-14s -- fully covered, U-mode reaches all of it\n", regions[i].name);
        }
    }
}

/****************************************************************************
 * Name: boot_report
 *
 * Description:
 *   What the privilege and memory configuration actually is at the moment the
 *   kernel starts, printed rather than assumed.  If U-mode ever fails with an
 *   instruction access fault, this is the first thing to read.
 *
 ****************************************************************************/
static void boot_report(void)
{
    const uintptr_t iram_end = (uintptr_t) &_iram_text_end;
    const uintptr_t user_pc = (uintptr_t) user_main;
    int i;

    kprintf("\n");
    kprintf("=== ESP32-P4 protected-mode demo: M-mode kernel, U-mode user ===\n");
    kprintf("KERNEL: mstatus=%08lx mtvec=%08lx mintstatus=%08lx\n", (unsigned long) umode_read_mstatus(), (unsigned long) umode_read_mtvec(), (unsigned long) umode_read_mintstatus());
    kprintf("KERNEL: pmpcfg 0=%08lx 1=%08lx 2=%08lx 3=%08lx\n", (unsigned long) umode_read_pmpcfg(0), (unsigned long) umode_read_pmpcfg(1), (unsigned long) umode_read_pmpcfg(2), (unsigned long) umode_read_pmpcfg(3));

    pmp_report();
    kprintf(
        "KERNEL: IRAM text ends at %08lx; PMP entry 4 grants U-mode R+X "
        "below it\n",
        (unsigned long) iram_end);
    kprintf("KERNEL: user text  %08lx (%s)\n", (unsigned long) user_pc, (user_pc >= SOC_IRAM_LOW && user_pc < iram_end) ? "inside the U-mode execute grant" : "OUTSIDE the grant -- U-mode will fault on the fetch");
    kprintf("KERNEL: %d U-mode windows, NONE of them pinned, sharing that one user_main:\n", USER_SLOTS);

    for (i = 0; i < USER_SLOTS; i++)
    {
        const user_slot_t *u = &g_slots[i];
        const uintptr_t lo = (uintptr_t) u->arena;

        /* No core is printed: nothing is pinned, so where this window runs is
         * not decided yet and will not stay decided.  kernel_task reports the
         * live answer once things are running.
         */

        kprintf("KERNEL:   %s arena %08lx..%08lx (%u bytes, stack and data)\n", u->name, (unsigned long) lo, (unsigned long) (lo + u->arena_size), (unsigned) u->arena_size);
    }

    kprintf(
        "KERNEL: the arenas are separate objects and every syscall pointer is\n"
        "KERNEL:   checked against the calling user's own bounds, so no user\n"
        "KERNEL:   can reach another's memory through the kernel\n");

#if CONFIG_ESP_SYSTEM_HW_STACK_GUARD
    kprintf("KERNEL: hardware stack guard follows each window on to its own arena,\n");
    kprintf("KERNEL:   read from the assist_debug block of the core it runs on\n");
    #if SOC_CPU_CORES_NUM > 1
    kprintf(
        "KERNEL: COST: both cores are un-routed from the shared assist_debug\n"
        "KERNEL:   source, so ESP-IDF no longer panics on an M-mode stack\n"
        "KERNEL:   overflow on either core.  The monitors still latch, and each\n"
        "KERNEL:   window still reports its own user's excursions.\n");
    #endif
#else
    kprintf("KERNEL: hardware stack guard is disabled in this build\n");
#endif
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: kernel_main
 *
 * Description:
 *   The protected-mode application.  Brings up the console lock, reports the
 *   privilege configuration, and starts the two tasks.
 *
 ****************************************************************************/
void kernel_main(void)
{
    g_console_mux = xSemaphoreCreateMutex();
    configASSERT(g_console_mux != NULL);

#if CONFIG_ESP_SYSTEM_HW_STACK_GUARD && SOC_CPU_CORES_NUM > 1

