NevynUK/ESP32-P4-Protected-Mode-Sample/main/kernel_main.c
    /* Take EVERY core out of the assist_debug interrupt routing.
     *
     * ETS_ASSIST_DEBUG_INTR_SOURCE is ONE source in the interrupt matrix, and
     * esp_hw_stack_guard_init() runs on every core, so each core routes it to
     * its own ETS_ASSIST_DEBUG_INUM.  A violation on one core's monitor is
     * therefore delivered to the other core as well -- where the CLIC threshold
     * that umode.S raises for its own window means nothing.  The other core
     * takes it, finds no explanation (the first core clears the latch on the way
     * out of its window) and panics the whole system with "ASSIST_DEBUG is not
     * triggered BUT interrupt occurred!".
     *
     * The peripheral offers no way to separate the two -- on this SoC
     * ASSIST_DEBUG_CORE_n_MONITOR_REG is #defined to
     * ASSIST_DEBUG_CORE_n_INTR_ENA_REG, so the monitor enable and the interrupt
     * enable are the same bits.  Un-routing the source is the only lever.
     *
     * WITH ONE WINDOW this loop skipped the window's own core, so that core kept
     * IDF's stack-guard panic for its M-mode stacks.  WITH A WINDOW ON EVERY
     * CORE there is no core left to keep it: whichever core a violation is
     * attributed to, some other core in a window has the source routed and will
     * panic on it.  So the source comes out everywhere, and the price is stated
     * plainly in the boot report -- ESP-IDF will no longer panic on an M-mode
     * stack overflow on either core.
     *
     * What is NOT lost: the monitors still run and still latch into their own
     * INTR_RAW, and each window still reads its own core's latch on the way out,
     * so a U-mode stack excursion is still caught and still attributed to the
     * user that caused it.  The residue is that a kernel-side latch on a core is
     * cleared by that core's next window entry, so an M-mode overflow there goes
     * unreported rather than merely unpanicked.
     */

    for (int core = 0; core < SOC_CPU_CORES_NUM; core++)
    {
        esp_rom_route_intr_matrix(core, ETS_ASSIST_DEBUG_INTR_SOURCE, ETS_INVALID_INUM);
    }

#endif

    for (int i = 0; i < USER_SLOTS; i++)
    {
        snprintf(g_slot_names[i], sizeof(g_slot_names[i]), "user%d", i);

        g_slots[i].name = g_slot_names[i];
        g_slots[i].id = (uint32_t) i;
        g_slots[i].arena = g_user_arenas[i];
        g_slots[i].arena_size = sizeof(g_user_arenas[i]);
    }

    boot_report();

    xTaskCreatePinnedToCore(kernel_task, "kernel", KERNEL_TASK_STACK, NULL, KERNEL_TASK_PRIO, NULL, tskNO_AFFINITY);

    /* One host task per slot, each pinned to its slot's core.  The task name
     * carries the slot name so the two are distinguishable in any FreeRTOS
     * introspection, and the slot is the task argument -- the host task reads
     * everything it needs from it and touches no other slot.
     */

    for (int i = 0; i < USER_SLOTS; i++)
    {
        xTaskCreatePinnedToCore(user_host_task, g_slots[i].name, USER_HOST_STACK, &g_slots[i], USER_HOST_PRIO, NULL, tskNO_AFFINITY);
    }
}

/****************************************************************************
 * Name: app_main
 *
 * Description:
 *   ESP-IDF's entry point.  It has already brought the SoC up and started the
 *   scheduler by the time this runs; the kernel proper is kernel_main().
 *
 ****************************************************************************/
void app_main(void)
{
    kernel_main();
}
